stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc_ex.c
  /* Get BDCR register value */
  tmpreg = RCC->BDCR;

  /* Get the RTC clock source ------------------------------------------------*/
  PeriphClkInit->RTCClockSelection = (tmpreg & RCC_BDCR_RTCSEL);
}


/**
  * @brief  Return the peripheral clock frequency for peripherals
  * @note   Return 0 if peripheral clock identifier not managed by this API or
  *         if clock source is turned off.
  * @note   MISRAC2012-Rule-17.2_a waiver has been granted as function is
  *         intentionally calls itself when a peripheral kernel clock frequency
  *         depends on other peripheral kernel clock. Recursion is limited to
  *         only one call.
  * @param  PeriphClk  Peripheral clock identifier
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PERIPHCLK_USART1   USART1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_USART3   USART3 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_UART4    UART4 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_UART5    UART5 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I3C1     I3C1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I2C1     I2C1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I2C2     I2C2 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I3C2     I3C2 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_SPI2     SPI2 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_LPTIM2   LPTIM2 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_SPI1     SPI1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_SYSTICK  SYSTICK peripheral clock
  *            @arg @ref RCC_PERIPHCLK_FDCAN    FDCAN peripheral clock
  *            @arg @ref RCC_PERIPHCLK_ICLK     ICLK peripheral clock
  *            @arg @ref RCC_PERIPHCLK_USB1     USB1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_TIMIC    TIMIC peripheral clock
  *            @arg @ref RCC_PERIPHCLK_ADF1     ADF1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_SPI3     SPI3 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_SAI1     SAI1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_RNG      RNG peripheral clock
  *            @arg @ref RCC_PERIPHCLK_ADCDAC   ADCDAC peripheral clock
  *            @arg @ref RCC_PERIPHCLK_DAC1SH   DAC1SH peripheral clock
  *            @arg @ref RCC_PERIPHCLK_OCTOSPI1 OCTOSPI1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_LPUART1  LPUART1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_I2C3     I2C3 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_LPTIM34  LPTIM34 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_LPTIM1   LPTIM1 peripheral clock
  *            @arg @ref RCC_PERIPHCLK_USART2   USART2 peripheral clock (*)
  *            @arg @ref RCC_PERIPHCLK_I2C4     I2C4 peripheral clock (*)
  *            @arg @ref RCC_PERIPHCLK_SPI4     SPI4 peripheral clock (*)
  *            @arg @ref RCC_PERIPHCLK_RTC      RTC peripheral clock
  *
  *            (*) value not defined in all devices.
  * @retval Frequency in Hz
  */
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk)
{
  uint32_t frequency = 0;
  uint32_t srcclk;

  /* Check the parameters */
  assert_param(IS_RCC_PERIPHCLOCK(PeriphClk));

  switch (PeriphClk)
  {
    case RCC_PERIPHCLK_USART1:
      /* Get the current USART1 source */
      srcclk = __HAL_RCC_GET_USART1_SOURCE();

      if (srcclk == RCC_USART1CLKSOURCE_PCLK2)
      {
        frequency = HAL_RCC_GetPCLK2Freq();
      }
      else /* srcclk == RCC_USART1CLKSOURCE_HSI */
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      break;

    case RCC_PERIPHCLK_USART3:
      /* Get the current USART3 source */
      srcclk = __HAL_RCC_GET_USART3_SOURCE();

      if (srcclk == RCC_USART3CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else  /* srcclk == RCC_USART3CLKSOURCE_HSI */
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      break;

    case RCC_PERIPHCLK_UART4:
      /* Get the current UART4 source */
      srcclk = __HAL_RCC_GET_UART4_SOURCE();

      if (srcclk == RCC_UART4CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_UART4CLKSOURCE_HSI */
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      break;

    case RCC_PERIPHCLK_UART5:
      /* Get the current UART5 source */
      srcclk = __HAL_RCC_GET_UART5_SOURCE();

      if (srcclk == RCC_UART5CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_UART5CLKSOURCE_HSI */
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      break;

    case RCC_PERIPHCLK_I3C1:
      /* Get the current I3C1 source */
      srcclk = __HAL_RCC_GET_I3C1_SOURCE();

      if (srcclk == RCC_I3C1CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_I3C1CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_I2C1:
      /* Get the current I2C1 source */
      srcclk = __HAL_RCC_GET_I2C1_SOURCE();

      if (srcclk == RCC_I2C1CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_I2C1CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_I2C2:
      /* Get the current I2C2 source */
      srcclk = __HAL_RCC_GET_I2C2_SOURCE();

      if (srcclk == RCC_I2C2CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_I2C2CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_I3C2:
      /* Get the current I3C2 source */
      srcclk = __HAL_RCC_GET_I3C2_SOURCE();

      if (srcclk == RCC_I3C2CLKSOURCE_PCLK2)
      {
        frequency = HAL_RCC_GetPCLK2Freq();
      }
      else /* srcclk == RCC_I3C2CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_SPI2:
      /* Get the current SPI2 kernel source */
      srcclk = __HAL_RCC_GET_SPI2_SOURCE();

      if (srcclk == RCC_SPI2CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_SPI2CLKSOURCE_MSIK */
      {
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_LPTIM2:
      /* Get the current LPTIM2 source */
      srcclk = __HAL_RCC_GET_LPTIM2_SOURCE();

      if (srcclk == RCC_LPTIM2CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      /* Check if LSI1 or LIS2 is ready and if LPTIM2 clock selection is LSI */
      else if (srcclk == RCC_LPTIM2CLKSOURCE_LSI)
      {
        if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY))
        {
          /* LSI Frequency */
          frequency = LSI_VALUE;

          /* Check is LSI1 is divided */
          if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIPREDIV))
          {
            frequency /= 128U;
          }
        }
      }
      else if (srcclk == RCC_LPTIM2CLKSOURCE_HSI)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      else /* srcclk == RCC_LPTIM2CLKSOURCE_LSE */
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      break;

