stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc_ex.c
    case RCC_PERIPHCLK_SPI1:
      /* Get the current SPI1 kernel source */
      srcclk = __HAL_RCC_GET_SPI1_SOURCE();

      if (srcclk == RCC_SPI1CLKSOURCE_PCLK2)
      {
        frequency = HAL_RCC_GetPCLK2Freq();
      }
      else /* srcclk == RCC_SPI1CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_SYSTICK:
      /* Get the current SYSTICK kernel source */
      srcclk = __HAL_RCC_GET_SYSTICK_SOURCE();

      if (srcclk == RCC_SYSTICKCLKSOURCE_HCLK_DIV8)
      {
        frequency = (HAL_RCC_GetHCLKFreq() / 8u);
      }
      else if (srcclk == RCC_SYSTICKCLKSOURCE_LSE)
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      else if (srcclk == RCC_SYSTICKCLKSOURCE_LSI)
      {
        if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY))
        {
          /* LSI Frequency */
          frequency = LSI_VALUE;

          /* Check is LSI1 is divided */
          if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIPREDIV))
          {
            frequency /= 128u;
          }
        }
      }
      else
      {
        /* Do nothing ; for misra 15.7 error only */
      }
      break;

    case RCC_PERIPHCLK_FDCAN:
      /* Get the current FDCAN source */
      srcclk = __HAL_RCC_GET_FDCAN_SOURCE();

      if (srcclk == RCC_FDCANCLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else /* srcclk == RCC_FDCANCLKSOURCE_SYSCLK */
      {
        frequency = HAL_RCC_GetSysClockFreq();
      }
      break;

    case RCC_PERIPHCLK_ICLK:
      /* Get the current ICLK source */
      srcclk = __HAL_RCC_GET_ICLK_SOURCE();

      if (srcclk == RCC_ICLKCLKSOURCE_HSI48)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSI48RDY))
        {
          frequency = HSI48_VALUE;
        }
      }
      else if (srcclk == RCC_ICLKCLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else if (srcclk == RCC_ICLKCLKSOURCE_HSE)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSERDY))
        {
          frequency = HSE_VALUE;
        }
      }
      else /* srcclk == RCC_ICLKCLKSOURCE_SYSCLK */
      {
        frequency = HAL_RCC_GetSysClockFreq();
      }
      break;

    case RCC_PERIPHCLK_USB1:
      /* Compute Intermediate clock frequency */
      frequency = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_ICLK);

      /* Get the current USB1 source */
      srcclk = __HAL_RCC_GET_USB1_SOURCE();

      if (srcclk == RCC_USB1CLKSOURCE_ICLK_DIV2)
      {
        frequency = (frequency >> 1u);
      }
      break;

    case RCC_PERIPHCLK_ADF1:
      /* Get the current ADF1 source */
      srcclk = __HAL_RCC_GET_ADF1_SOURCE();

      if (srcclk == RCC_ADF1CLKSOURCE_HCLK)
      {
        frequency = HAL_RCC_GetHCLKFreq();
      }
      else if (srcclk == RCC_ADF1CLKSOURCE_PIN)
      {
        frequency = EXTERNAL_SAI1_CLOCK_VALUE;
      }
      else if (srcclk == RCC_ADF1CLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else /* srcclk == RCC_ADF1CLKSOURCE_SAI1K */
      {
        /* Compute SAI1 frequency */
        frequency = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SAI1);
      }
      break;

    case RCC_PERIPHCLK_SPI3:
      /* Get the current SPI3 kernel source */
      srcclk = __HAL_RCC_GET_SPI3_SOURCE();

      if (srcclk == RCC_SPI3CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_SPI3CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_SAI1:
      /* Get the current SAI1 source */
      srcclk = __HAL_RCC_GET_SAI1_SOURCE();

      if (srcclk == RCC_SAI1CLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else if (srcclk == RCC_SAI1CLKSOURCE_PIN)
      {
        frequency = EXTERNAL_SAI1_CLOCK_VALUE;
      }
      else if (srcclk == RCC_SAI1CLKSOURCE_HSE)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSERDY))
        {
          frequency = HSE_VALUE;
        }
      }
      else
      {
        /* Do nothing ; for misra 15.7 error only */
      }
      break;

    case RCC_PERIPHCLK_RNG:
      /* Get the current RNG source */
      srcclk = __HAL_RCC_GET_RNG_SOURCE();

      if (srcclk == RCC_RNGCLKSOURCE_HSI48)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSI48RDY))
        {
          frequency = HSI48_VALUE;
        }
      }
      else /* srcclk == RCC_RNGCLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_ADCDAC:
      /* Get the current ADC DAC kernel source */
      srcclk = __HAL_RCC_GET_ADCDAC_SOURCE();

      if (srcclk == RCC_ADCDACCLKSOURCE_HCLK)
      {
        frequency = HAL_RCC_GetHCLKFreq();
      }
      else if (srcclk == RCC_ADCDACCLKSOURCE_HSE)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSERDY))
        {
          frequency = HSE_VALUE;
        }
      }
      else if (srcclk == RCC_ADCDACCLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else
      {
        /* Do nothing ; for misra 15.7 error only */
      }

      /* Get the current ADC DAC clock divider source */
      srcclk = __HAL_RCC_GET_ADCDAC_DIV();

      if (srcclk == RCC_ADCDACCLK_DIV1)
      {
        /* No divider selected */
        srcclk = 0u;
      }
      else if (srcclk < RCC_CCIPR2_ADCDACPRE_3)
      {
        /* divider is 2 */
        srcclk = 1u;
      }
      else
      {
        /* compute divider */
        srcclk = ((srcclk & ~RCC_CCIPR2_ADCDACPRE_3) >> RCC_CCIPR2_ADCDACPRE_Pos) + 2u;
      }

      /* Compute frequency */
      frequency = (frequency >> srcclk);
      break;

