stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc_ex.c
    case RCC_PERIPHCLK_DAC1SH:
      /* Get the current ADC kernel source */
      srcclk = __HAL_RCC_GET_DAC1SH_SOURCE();

      if (srcclk == RCC_DAC1SHCLKSOURCE_LSI)
      {
        if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY))
        {
          /* LSI Frequency */
          frequency = LSI_VALUE;

          /* Check is LSI1 is divided */
          if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIPREDIV))
          {
            frequency /= 128u;
          }
        }
      }
      else /* srcclk == RCC_DAC1SHCLKSOURCE_LSE */
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      break;

    case RCC_PERIPHCLK_OCTOSPI1:
      /* Get the current OCTOSPI1 source */
      srcclk = __HAL_RCC_GET_OCTOSPI_SOURCE();

      if (srcclk == RCC_OCTOSPICLKSOURCE_SYSCLK)
      {
        frequency = HAL_RCC_GetSysClockFreq();
      }
      else /* srcclk == RCC_OCTOSPICLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_LPUART1:
      /* Get the current LPUART1 source */
      srcclk = __HAL_RCC_GET_LPUART1_SOURCE();

      if (srcclk == RCC_LPUART1CLKSOURCE_PCLK3)
      {
        frequency = HAL_RCC_GetPCLK3Freq();
      }
      else if (srcclk == RCC_LPUART1CLKSOURCE_HSI)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      else if (srcclk == RCC_LPUART1CLKSOURCE_LSE)
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      else /* srcclk == RCC_LPUART1CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_I2C3:
      /* Get the current I2C3 source */
      srcclk = __HAL_RCC_GET_I2C3_SOURCE();

      if (srcclk == RCC_I2C3CLKSOURCE_PCLK3)
      {
        frequency = HAL_RCC_GetPCLK3Freq();
      }
      else /* srcclk == RCC_I2C3CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;

    case RCC_PERIPHCLK_LPTIM34:
      /* Get the current LPTIM34 source */
      srcclk = __HAL_RCC_GET_LPTIM34_SOURCE();

      if (srcclk == RCC_LPTIM34CLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else if (srcclk == RCC_LPTIM34CLKSOURCE_LSI)
      {
        if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY))
        {
          /* LSI Frequency */
          frequency = LSI_VALUE;

          /* Check is LSI1 is divided */
          if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIPREDIV))
          {
            frequency /= 128u;
          }
        }
      }
      else if (srcclk == RCC_LPTIM34CLKSOURCE_HSI)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      else /* srcclk == RCC_LPTIM34CLKSOURCE_LSE */
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      break;

    case RCC_PERIPHCLK_LPTIM1:
      /* Get the current LPTIM1 source */
      srcclk = __HAL_RCC_GET_LPTIM1_SOURCE();

      if (srcclk == RCC_LPTIM1CLKSOURCE_MSIK)
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      else if (srcclk == RCC_LPTIM1CLKSOURCE_LSI)
      {
        if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY))
        {
          /* LSI Frequency */
          frequency = LSI_VALUE;

          /* Check is LSI1 is divided */
          if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIPREDIV))
          {
            frequency /= 128u;
          }
        }
      }
      else if (srcclk == RCC_LPTIM1CLKSOURCE_HSI)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      else /* srcclk == RCC_LPTIM1CLKSOURCE_LSE */
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      break;

#if defined(USART2)
    case RCC_PERIPHCLK_USART2:
      /* Get the current USART2 source */
      srcclk = __HAL_RCC_GET_USART2_SOURCE();

      if (srcclk == RCC_USART2CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else  /* srcclk == RCC_USART2CLKSOURCE_HSI */
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSIRDY))
        {
          frequency = HSI_VALUE;
        }
      }
      break;
#endif /* USART2 */

#if defined(I2C4)
    case RCC_PERIPHCLK_I2C4:
      /* Get the current I2C4 source */
      srcclk = __HAL_RCC_GET_I2C4_SOURCE();

      if (srcclk == RCC_I2C4CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_I2C4CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;
#endif /* I2C4 */

#if defined(SPI4)
    case RCC_PERIPHCLK_SPI4:
      /* Get the current SPI4 kernel source */
      srcclk = __HAL_RCC_GET_SPI4_SOURCE();

      if (srcclk == RCC_SPI4CLKSOURCE_PCLK1)
      {
        frequency = HAL_RCC_GetPCLK1Freq();
      }
      else /* srcclk == RCC_SPI3CLKSOURCE_MSIK */
      {
        /* Do not check RDY flag as done in get frequency API */
        frequency = HAL_RCC_GetMSIKFreq();
      }
      break;
#endif /* SPI4 */

    case RCC_PERIPHCLK_RTC:
      /* Get the current RTC source */
      srcclk = __HAL_RCC_GET_RTC_SOURCE();

      /* Check if LSE is ready and if RTC clock selection is LSE */
      if (srcclk == RCC_RTCCLKSOURCE_LSE)
      {
        if (HAL_IS_BIT_SET(RCC->BDCR, RCC_BDCR_LSERDY))
        {
          frequency = LSE_VALUE;
        }
      }
      /* Check if LSI1 or LIS2 is ready and if RTC clock selection is LSI */
      else if (srcclk == RCC_RTCCLKSOURCE_LSI)
      {
        if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIRDY))
        {
          /* LSI Frequency */
          frequency = LSI_VALUE;

          /* Check is LSI1 is divided */
          if (HAL_IS_BIT_SET(RCC->CSR, RCC_CSR_LSIPREDIV))
          {
            frequency /= 128u;
          }
        }
      }
      /* Check if HSE is ready and if RTC clock selection is HSE_DIV32*/
      else if (srcclk == RCC_RTCCLKSOURCE_HSE_DIV32)
      {
        if (HAL_IS_BIT_SET(RCC->CR, RCC_CR_HSERDY))
        {
          frequency = HSE_VALUE / 32u;
        }
      }
      else
      {
        /* Do nothing ; for misra 15.7 error only */
      }
      break;

    /* Do nothing for Timer input capture as clock source is selected in timer block */
    case RCC_PERIPHCLK_TIMIC:
    default:
      break;
  }

