stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc_ex.c
  return (frequency);
}

/**
  * @}
  */

/** @defgroup RCCEx_Exported_Functions_Group2 Extended Clock management functions
  *  @brief  Extended Clock management functions
  *
@verbatim
 ===============================================================================
                ##### Extended clock management functions  #####
 ===============================================================================
    [..] This subsection provides a set of functions allowing to control:

         (+) EPOD Booster clock configuration.
         (+) MSI RC PLL mode.
         (+) SYSCLK source on wakeup from STOP.
         (+) Automatic kernel clock startup on wakeup from STOP.
         (+) Capability to keep kernel clock on in stop.
         (+) MSIS and MSIK clock frequency at standby exit.
         (+) Activation or deactivation of LSE CSS.
         (+) Activation or deactivation of Low Speed Clock Output (LSCO).
@endverbatim
  * @{
  */

/**
  * @brief  Configure EPOD Booster clock.
  * @param  Source    The EPOD booster clock source.
                      This parameter can be a value of @ref RCC_EPOD_Booster_Source
  * @param  Divider   The division factor of EPOD booster clock.
                      This parameter can be a value of @ref RCC_EPOD_Booster_Div
  * @note   Clock source and divider shall be selected to reach an input Booster Clock between 3 and 16 MHz.
  * @note   If MSI is selected as EPOD source, divider is automatically chosen by hardware. Thus Divider parameter
  *         will be ignored
  * @note   When booster is not user, clock source shall be set to RCC_EPODBOOSTER_SOURCE_NONE to save power.
  * @retval None
  */
HAL_StatusTypeDef HAL_RCCEx_EpodBoosterClkConfig(uint32_t Source, uint32_t Divider)
{
  uint32_t tmpreg1;
  HAL_StatusTypeDef status;

  assert_param(IS_RCC_EPODBOOSTER_SOURCE(Source));
  assert_param(IS_RCC_EPODBOOSTER_DIV(Divider));

  /* check if any source is selected and ready */
  tmpreg1 = RCC->CR;

  /* MSIS is selected as EPOD Booster clock source, check if MSIS is ready */
  if ((Source == RCC_EPODBOOSTER_SOURCE_MSIS) && ((tmpreg1 & RCC_CR_MSISRDY) == 0U))
  {
    status = HAL_ERROR;
  }
  /* HSI is selected as EPOD Booster clock source, check if HSI is ready */
  else if ((Source == RCC_EPODBOOSTER_SOURCE_HSI) && ((tmpreg1 & RCC_CR_HSIRDY) == 0U))
  {
    status = HAL_ERROR;
  }
  /* HSE is selected as EPOD Booster clock source, check if HSE is ready */
  else if ((Source == RCC_EPODBOOSTER_SOURCE_HSE) && ((tmpreg1 & RCC_CR_HSERDY) == 0U))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Apply configuration */
    tmpreg1 = (RCC->CFGR4 & ~(RCC_CFGR4_BOOSTDIV | RCC_CFGR4_BOOSTSEL));
    tmpreg1 |= (Divider | Source);
    RCC->CFGR4 = tmpreg1;

    /* update status is ok */
    status = HAL_OK;
  }

  return status;
}

/**
  * @brief  Get EPOD clock configuration.
  * @param  Source    Pointer to EPOD booster clock source value.
  * @param  Divider   Pointer to EPOD booster clock divider value.
  * @retval None
  */
void HAL_RCCEx_GetEpodBoosterClkConfig(uint32_t *Source, uint32_t *Divider)
{
  uint32_t tmpreg1;

  /* Get booster clock configuration */
  tmpreg1 = RCC->CFGR4;

  /* Retrieve source and divider */
  *Source = (tmpreg1 & RCC_CFGR4_BOOSTSEL);
  *Divider = (tmpreg1 & RCC_CFGR4_BOOSTDIV);
}

/**
  * @brief  Configure MSIRCx PLL mode.
  * @param  MSISrce   MSIRC source to configure in PLL mode.
  *         This parameter can be a value of @ref RCC_MSI_Source
  * @param  RCxPLLMode  pointer to an RCC_MSIRCxPLLTypeDef structure that
  *         contains the configuration information for MSIRCx PLL mode.
  * @note   If HSE is selected as PLL input source for both MSIRCx, it shall be kept with same divider (1 or 2).
  * @note   For MSI RC1, PLL multiplication factor N shall be set wisely. Else, this field can be left empty.
  * @retval None
  */
HAL_StatusTypeDef HAL_RCCEx_MSIRCxPLLModeConfig(uint32_t MSISrce, const RCC_MSIRCxPLLTypeDef *RCxPLLMode)
{
  uint32_t tmpcr;
  uint32_t tmpicscr1;
  uint32_t offset;
  uint32_t mask;

  /* Check Null pointer */
  if (RCxPLLMode == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_RCC_MSI_SOURCE(MSISrce));
  assert_param(IS_RCC_MSI_PLL(RCxPLLMode->State));

  if (MSISrce != RCC_MSI_RC0)
  {
    offset = 0x00u;
  }
  else
  {
    offset = 0x01u;
  }

  /* Read configuration register */
  tmpcr = RCC->CR;

  /* Compute activation mask */
  mask = (1uL << (RCC_CR_MSIPLL1EN_Pos + offset));

  /* check if PLL mode is asked to be enabled or disabled */
  if (RCxPLLMode->State != RCC_MSIRCx_PLL_OFF)
  {
    assert_param(IS_RCC_MSI_PLL_INPUT(RCxPLLMode->InputSrce));
    assert_param(IS_RCC_MSI_PLL_FASTMODE(RCxPLLMode->FastMode));

    /* Configure PLL input source */
    tmpicscr1 = RCC->ICSCR1;

    /* Set PLL input source */
    tmpicscr1 &= ~(RCC_ICSCR1_MSIPLL1SEL << offset);
    tmpicscr1 |= ((RCxPLLMode->InputSrce & RCC_ICSCR1_MSIPLL1SEL) << offset);

    /* Check if PLL source is HSE */
    if ((RCxPLLMode->InputSrce & RCC_ICSCR1_MSIPLL1SEL) != 0x00u)
    {
      assert_param(IS_RCC_MSI_PLL_INPUT_HSE_FREQ(HSE_VALUE));

      /* Clear or set HSE source divider */
      if (HSE_VALUE != RCC_MSIRCx_PLL_INPUT_HSE32)
      {
        tmpicscr1 &= ~RCC_ICSCR1_MSIHSINDIV;
      }
      else
      {
        tmpicscr1 |= RCC_ICSCR1_MSIHSINDIV;
      }
    }

    /* Check if RC1 is being configured */
    if (MSISrce != RCC_MSI_RC0)
    {
      assert_param(IS_RCC_MSI_PLL_NVALUE(RCxPLLMode->MSIRC1PLLN));

      /* Adjust PLL N multiplication factor */
      tmpicscr1 &= ~RCC_ICSCR1_MSIPLL1N;
      tmpicscr1 |= RCxPLLMode->MSIRC1PLLN;
    }

    /* Write configuration */
    RCC->ICSCR1 = tmpicscr1;

    /* Configure PLL fast mode */
    tmpcr &= ~(1uL << (RCC_CR_MSIPLL1FAST_Pos + offset));
    tmpcr |= (RCxPLLMode->FastMode << offset);

    /* Enable PLL mode for selected RC */
    tmpcr |= mask;
  }
  else
  {
    /* Disable PLL mode for selected RC */
    tmpcr &= ~mask;
  }

  /* Write configuration register */
  RCC->CR = tmpcr;

  /* Compute ready flag data */
  mask <<= (RCC_CR_MSIPLL1RDY_Pos - RCC_CR_MSIPLL1EN_Pos);
  tmpicscr1 = ((RCxPLLMode->State << (RCC_CR_MSIPLL1RDY_Pos - RCC_CR_MSIPLL1EN_Pos)) << offset);

  /* Get Start Tick*/
  tmpcr = HAL_GetTick();

  /* Wait until ready flag status */
  while (READ_BIT(RCC->CR, mask) != tmpicscr1)
  {
    if ((HAL_GetTick() - tmpcr) > MSI_PLL_TIMEOUT_VALUE)
    {
      if (READ_BIT(RCC->CR, mask) != tmpicscr1)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Get MSIRCx PLL mode.
  * @param  MSISrce   MSIRC source to get PLL configuration.
  *         This parameter can be a value of @ref RCC_MSI_Source
  * @param  RCxPLLMode  pointer to an RCC_MSIRCxPLLTypeDef structure that
  *         will return the configuration information for MSIRCx PLL mode.
  * @retval None
  */
void HAL_RCCEx_GetMSIRCxPLLModeConfig(uint32_t MSISrce, RCC_MSIRCxPLLTypeDef *RCxPLLMode)
{
  uint32_t tmpcr;
  uint32_t offset;

  /* Check the parameters */
  assert_param(RCxPLLMode != (void *)NULL);
  assert_param(IS_RCC_MSI_SOURCE(MSISrce));

  if (MSISrce != RCC_MSI_RC0)
  {
    offset = 0x00u;
  }
  else
  {
    offset = 0x01u;
  }

  /* Read configuration register */
  tmpcr = RCC->CR;
  RCxPLLMode->State = ((tmpcr & (1uL << (RCC_CR_MSIPLL1EN_Pos + offset))) >> offset);
  RCxPLLMode->FastMode = ((tmpcr & (1uL << (RCC_CR_MSIPLL1FAST_Pos + offset))) >> offset);

  /* Read ICSCR1 register */
  tmpcr = RCC->ICSCR1;
  RCxPLLMode->InputSrce = ((tmpcr & (1uL << (RCC_ICSCR1_MSIPLL1SEL_Pos + offset))) >> offset);

