stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc_ex.c
  /* Check if source is HSE */
  if ((RCxPLLMode->InputSrce & RCC_ICSCR1_MSIPLL1SEL) != 0x00u)
  {
    /* Get HSE divider */
    RCxPLLMode->InputSrce |= (tmpcr & RCC_ICSCR1_MSIHSINDIV);
  }
  else
  {
    /* If MSI source is MSIRC1 */
    if (MSISrce != RCC_MSI_RC0)
    {
      /* Get PLLN multiplication factor */
      RCxPLLMode->MSIRC1PLLN = (tmpcr & RCC_ICSCR1_MSIPLL1N);
    }
  }
}

/**
  * @brief  Configure the system clock source for wakeup from Stop and to be used as emergency clock for the Clock
  *         security system on HSE.
  * @param  WakeupClk  Wakeup clock
  *         This parameter can be one of the following values:
  *            @arg RCC_STOP_WKUP_SYSCLK_MSIS: MSIS oscillator selection
  *            @arg RCC_STOP_WKUP_SYSCLK_HSI:  HSI oscillator selection
  * @note   This function shall not be called after the Clock Security System on HSE has been
  *         enabled.
  * @retval None
  */
void HAL_RCCEx_StopWakeupSysclkConfig(uint32_t WakeupClk)
{
  assert_param(IS_RCC_STOP_WKUP_SYSCLK(WakeupClk));

  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_STOPWUCK, WakeupClk);
}

/**
  * @brief  Configure the Kernel clock source to be automatically enabled when wakeup from Stop.
  * @param  WakeupClk: Kernel Wakeup clock
  *         This parameter can be one of the following values:
  *            @arg RCC_KERNELCLK_MSIK: MSIK oscillator selection
  *            @arg RCC_KERNELCLK_HSI:  HSI oscillator selection
  * @retval None
  */
void HAL_RCCEx_StopWakeupKernelClkConfig(uint32_t WakeupClk)
{
  uint32_t cfgr1;

  assert_param(IS_RCC_KERNEL_CLK(WakeupClk));

  /* Read cfgr1 */
  cfgr1 = RCC->CFGR1;

  /* If selected source is HSI */
  if (WakeupClk == RCC_KERNELCLK_HSI)
  {
    cfgr1 |= RCC_CFGR1_STOPKERWUCK;
  }
  else
  {
    cfgr1 &= ~RCC_CFGR1_STOPKERWUCK;
  }

  /* write cfgr1 */
  RCC->CFGR1 = cfgr1;
}

/**
  * @brief  Enable a kernel clock to be forced ON when entering in STOP.
  *         Keeping a Oscillator on in stop mode allows to speed up communication by removing oscillator startup time.
  * @param  KernelClk  Wakeup clock
  *         This parameter can be a combination of following values:
  *            @arg RCC_KERNELCLK_MSIK: MSIK oscillator selection
  *            @arg RCC_KERNELCLK_HSI:  HSI oscillator selection
  * @note   HSI and MSIK kernel clocks shall be disabled when entering in STOP 3
  *         enabled.
  * @retval None
  */
void HAL_RCCEx_EnableKernelClkInStop(uint32_t KernelClk)
{
  assert_param(IS_RCC_MULTI_KERNEL_CLK(KernelClk));

  RCC->CR |= KernelClk;
}

/**
  * @brief  Disable a kernel clock to be forced ON when entering in STOP.
  * @param  KernelClk  Wakeup clock
  *         This parameter can be a combination of following values:
  *            @arg RCC_KERNELCLK_MSIK: MSIK oscillator selection
  *            @arg RCC_KERNELCLK_HSI:  HSI oscillator selection
  * @note   HSI and MSIK kernel clocks shall be disabled when entering in STOP 3
  *         enabled.
  * @retval None
  */
void HAL_RCCEx_DisableKernelClkInStop(uint32_t KernelClk)
{
  assert_param(IS_RCC_MULTI_KERNEL_CLK(KernelClk));

  RCC->CR &= ~KernelClk;
}


/**
  * @brief  Configure MSIS division at Standby mode exit.
  * @note   After a system reset, a power-on reset or when exiting Shutdown mode, range 5 (MSIRC1, DIV2, 12MHz)
  *         is always selected.
  * @note   API is forcing MSI range selection it, so out the function MSIS frequency will be driven by ICSCR1.
  * @param  MSISDiv  MSIS divider
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_MSI_DIV2  MSIS frequency is around 12 MHz (range 5, reset value)
  *            @arg @ref RCC_MSI_DIV4  MSIS frequency is around 6 MHz (range 6)
  *            @arg @ref RCC_MSI_DIV8  MSIS frequency is around 3 MHz (range 7)
  * @retval None
  */
void HAL_RCCEx_StandbyWakeupMSISConfig(uint32_t MSISDiv)
{
  uint32_t csr;

  assert_param(IS_RCC_MSI_STANDBY_DIV(MSISDiv));

  /* Allow write access to MSIS standby mode */
  RCC->ICSCR1 |= RCC_ICSCR1_MSIRGSEL;

  /* Modify exit from standby MSIS divider selection */
  csr = (RCC->CSR & ~RCC_CSR_MSISDIVS);
  csr |= (MSISDiv >> (RCC_ICSCR1_MSISDIV_Pos - RCC_CSR_MSISDIVS_Pos));
  RCC->CSR = csr;
}

/**
  * @brief  Configure MSIK division at Standby mode exit.
  * @note   After a system reset, a power-on reset or when exiting Shutdown mode, range 5 (MSIRC1, DIV2, 12MHz)
  *         is always selected.
  * @note   API is forcing MSI range selection it, so out the function MSIK frequency will be driven by ICSCR1.
  * @param  MSIKDiv  MSIK divider
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_MSI_DIV2  MSIK frequency is around 12 MHz (range 5, reset value)
  *            @arg @ref RCC_MSI_DIV4  MSIK frequency is around 6 MHz (range 6)
  *            @arg @ref RCC_MSI_DIV8  MSIK frequency is around 3 MHz (range 7)
  * @retval None
  */

void HAL_RCCEx_StandbyWakeupMSIKConfig(uint32_t MSIKDiv)
{
  uint32_t csr;

  assert_param(IS_RCC_MSI_STANDBY_DIV(MSIKDiv));

  /* Allow write access to MSIS standby mode */
  RCC->ICSCR1 |= RCC_ICSCR1_MSIRGSEL;

  /* Modify exit from standby MSIK divider selection */
  csr = (RCC->CSR & ~RCC_CSR_MSIKDIVS);
  csr |= (MSIKDiv >> (RCC_ICSCR1_MSISDIV_Pos - RCC_CSR_MSIKDIVS_Pos));
  RCC->CSR = csr;
}


/**
  * @brief  Enable the LSE Clock Security System.
  * @note   Prior to enable the LSE Clock Security System, LSE oscillator is to be enabled
  *         with HAL_RCC_OscConfig() and the LSE oscillator clock is to be selected as RTC
  *         clock with HAL_RCCEx_PeriphCLKConfig().
  * @retval None
  */
void HAL_RCCEx_EnableLSECSS(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Disable the LSE Clock Security System.
  * @note   LSE Clock Security System can only be disabled after a LSE failure detection.
  * @retval None
  */
void HAL_RCCEx_DisableLSECSS(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Select the Low Speed clock source to output on LSCO pin (PA2).
  * @param  LSCOSource  specifies the Low Speed clock source to output.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_LSCOSOURCE_LSI  LSI clock selected as LSCO source
  *            @arg @ref RCC_LSCOSOURCE_LSE  LSE clock selected as LSCO source
  * @retval None
  */
void HAL_RCCEx_EnableLSCO(uint32_t LSCOSource)
{
  /* Check the parameters */
  assert_param(IS_RCC_LSCOSOURCE(LSCOSource));

  /* Update LSCO selection according to parameter and enable LSCO */
  MODIFY_REG(RCC->BDCR, RCC_BDCR_LSCOSEL, LSCOSource | RCC_BDCR_LSCOEN);
}

/**
  * @brief  Disable the Low Speed clock output.
  * @retval None
  */
void HAL_RCCEx_DisableLSCO(void)
{
  /* Clear LSCOEN in BDCR register */
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSCOEN);
}

/**
  * @}
  */


